# OfVector Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform..::..OfVector Method
Transform Class See Also
---
Applies the transform to the vector
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ OfVector(
	XYZ vec
)
```

Visual Basic
---
```text
Public Function OfVector ( _
	vec As XYZ _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ OfVector(
	XYZ^ vec
)
```

# ### Parameters
vec
    Type: Autodesk.Revit.DB..::..XYZThe vector to be transformed
# ### Return Value
The new vector after transform
# Remarks
Transformation of a vector is not affected by the translational part of the transformation.
# See Also
Transform Class
Autodesk.Revit.DB Namespace